handsome666-c/ps-g/ps_g1/firmware/n32g05x_std_periph_driver/src/n32g05x_i2c.c
}

/**
*\*\name    I2C_SetMasterReceivedDataBytesNum.
*\*\fun     Set the number of data bytes that will be received by master receiver of I2C peripheral.
*\*\param   I2Cx :
*\*\          - I2C
*\*\param   Number_Of_bytes(the number of data bytes) :
*\*\          - 0x0~0x3FFF
*\*\return  none
**/
void I2C_SetMasterReceivedDataBytesNum(I2C_Module* I2Cx, uint16_t Number_Of_bytes)
{
    uint16_t temp_value;

    temp_value = I2Cx->BYTENUM;
    /* Clear BYTENUM[13:0] bits */
    temp_value &= I2C_BYTENUM_MASK;
    /* Set BYTENUM[13:0] bits according to Number_Of_bytes value */
    temp_value |= Number_Of_bytes;
    /* Store the new value */
    I2Cx->BYTENUM = temp_value;
}

/**
*\*\name    I2C_SetByteNumLastStartStop.
*\*\fun     Configure the last status after master have finished sending the required data bytes.
*\*\param   I2Cx :
*\*\          - I2C
*\*\param   LastStatus :
*\*\          - I2C_BYTENUM_LAST_STOP
*\*\ 		  - I2C_BYTENUM_LAST_START
*\*\return  none
**/
void I2C_SetByteNumLastStartStop(I2C_Module* I2Cx, uint16_t LastStatus)
{
	if (LastStatus == I2C_BYTENUM_LAST_START)
    {
        /* Next byte in shift register is PEC */
        I2Cx->BYTENUM |= I2C_BYTENUM_LAST_START;
    }
    else
    {
        /* Current byte in shift register is PEC */
        I2Cx->BYTENUM &= I2C_BYTENUM_LAST_STOP;
    }
}

/**
*\*\name    I2C_SetTimeoutLowLimit.
*\*\fun     timeout low threshold selection.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   limit:
*\*\          - I2C_TIMEOUT_LOWLIMIT_25MS 
*\*\ 		  - I2C_TIMEOUT_LOWLIMIT_100MS
*\*\ 		  - I2C_TIMEOUT_LOWLIMIT_1S   
*\*\ 		  - I2C_TIMEOUT_LOWLIMIT_4S   
*\*\return  none
**/
void I2C_SetTimeoutLowLimit(I2C_Module* I2Cx, uint32_t limit)
{
    uint32_t temp_value;

    temp_value = I2Cx->CTRL1;
    /* Clear LTOSEL[1:0] bits */
    temp_value &= I2C_LTOSEL_MASK;
    /* Set LTOSEL[1:0] bits according to limit value */
    temp_value |= limit;
    /* Store the new value */
    I2Cx->CTRL1 = temp_value;
}

/**
*\*\name    I2C_SetTimeoutHighLimit.
*\*\fun     timeout high threshold selection.
*\*\param   I2Cx :
*\*\          - I2C1
*\*\          - I2C2
*\*\param   limit:
*\*\          - I2C_TIMEOUT_HIGHLIMIT_256US
*\*\ 		  - I2C_TIMEOUT_HIGHLIMIT_512US
*\*\ 		  - I2C_TIMEOUT_HIGHLIMIT_1MS  
*\*\ 		  - I2C_TIMEOUT_HIGHLIMIT_128US
*\*\return  none
**/
void I2C_SetTimeoutHighLimit(I2C_Module* I2Cx, uint32_t limit)
{
    uint32_t temp_value;

    temp_value = I2Cx->CTRL1;
    /* Clear HTOSEL[1:0] bits */
    temp_value &= I2C_HTOSEL_MASK;
    /* Set HTOSEL[1:0] bits according to limit value */
    temp_value |= limit;
    /* Store the new value */
    I2Cx->CTRL1 = temp_value;
}

/**
*\*\name    I2C_ConfigTimeoutInt.
*\*\fun     Enables the specified I2C timeout interrupts.
*\*\param   I2Cx (The input parameters must be the following values):
*\*\          - I2C1
*\*\          - I2C2
*\*\param   I2C_IT (The input parameters must be the following values):
*\*\          - I2C_TIMEOUT_INT_SCLLOW     SCL low timeout error interrupt 
*\*\          - I2C_TIMEOUT_INT_SCLHIGH    SCL high timeout error interrupt 
*\*\          - I2C_TIMEOUT_INT_SDALOW     SDA low timeout error interrupt 
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE 
*\*\return  none
**/
void I2C_ConfigTimeoutInt(I2C_Module* I2Cx, uint32_t I2C_IT, FunctionalState Cmd)
{
    
    if (Cmd != DISABLE)
    {
        /* Enable the selected I2C timeout interrupts */
        I2Cx->CTRL2 |= I2C_IT;
    }
    else
    {
        /* Disable the selected I2C timeout interrupts */
        I2Cx->CTRL2 &= (~I2C_IT);
    }
}

/**
*\*\name    I2C_EnableTimeout.
*\*\fun     Enables the specified I2C timeout detection function .
*\*\param   I2Cx (The input parameters must be the following values):
*\*\          - I2C1
*\*\          - I2C2
*\*\param   timeout_type (The input parameters must be the following values):
*\*\          - I2C_TIMEOUT_LOW     low timeout function enable 
*\*\          - I2C_TIMEOUT_HIGH    high timeout function enable
*\*\param   Cmd: 
*\*\          - ENABLE  
*\*\          - DISABLE 
*\*\note    This function can be disabled in I2C mode when an timeout error is not required.
*\*\return  none
**/
void I2C_EnableTimeoutDetect(I2C_Module* I2Cx, uint32_t timeout_type, FunctionalState Cmd)
{
    
    if (Cmd != DISABLE)
    {
        /* Enable the selected I2C interrupts */
        I2Cx->CTRL2 |= timeout_type;
    }
    else
    {
        /* Disable the selected I2C interrupts */
        I2Cx->CTRL2 &= (~timeout_type);
    }
}

/**
*\*\name    I2C_GetTimeoutFlag.
*\*\fun     Checks whether the specified I2C timeout flag is set or not.
*\*\param   I2Cx (The input parameters must be the following values):
*\*\          - I2C1
*\*\          - I2C2
*\*\param   I2C_flag (The input parameters must be the following values):
*\*\          - I2C_TIMEOUT_FLAG_SCLLOW     SCL low timeout flag
*\*\          - I2C_TIMEOUT_FLAG_SCLHIGH    SCL high timeout flag
*\*\          - I2C_TIMEOUT_FLAG_SDALOW     SDA low timeout flag
*\*\return  SET or RESET
**/
FlagStatus I2C_GetTimeoutFlag(I2C_Module* I2Cx, uint32_t I2C_flag)
{
    FlagStatus bitstatus;
	
    if ((I2Cx->STS1 & I2C_flag) != (uint32_t)RESET)
    {
        bitstatus = SET;
    }
    else
    {
        bitstatus = RESET;
    }
    return bitstatus;
}

/**
*\*\name    I2C_ClrTimeoutFlag.
*\*\fun     Clears the I2Cx's pending flags.
*\*\param   I2Cx (The input parameters must be the following values):
*\*\          - I2C1
*\*\          - I2C2
*\*\param   I2C_flag (The input parameters must be the following values):
*\*\          - I2C_TIMEOUT_FLAG_SCLLOW     SCL low timeout flag
*\*\          - I2C_TIMEOUT_FLAG_SCLHIGH    SCL high timeout flag
*\*\          - I2C_TIMEOUT_FLAG_SDALOW     SDA low timeout flag
*\*\return  none
**/
void I2C_ClrTimeoutFlag(I2C_Module* I2Cx, uint32_t I2C_flag)
{
    /* Clear the selected I2C flag */
    I2Cx->STS1 = (~I2C_flag)&I2C_STS1_RESERVED_MASK;
}

